Repository: monetate/django-debug-toolbar
Catalog: debug_toolbar/locale/*/LC_MESSAGES/django.po
Languages: uz

source: Debug Toolbar
uz: Tekshiruv Paneli

source: history entry
uz: tarix yozuvi

source: history entries
uz: tarix yozuvlari

source: Form with id "{form_id}" contains file input, but does not have the attribute enctype="multipart/form-data".
uz: "{form_id}" identifikatorli forma fayl maydonini o'z ichiga oladi, lekin enctype="multipart/form-data" atributiga ega emas.

source: Form contains file input, but does not have the attribute enctype="multipart/form-data".
uz: Forma fayl maydonini o'z ichiga oladi, lekin enctype="multipart/form-data" atributiga ega emas.

source: Input element references form with id "{form_id}", but the form does not have the attribute enctype="multipart/form-data".
uz: Kiritish elementi "{form_id}" formaga bog'langan, lekin unda enctype="multipart/form-data" atributi yo'q.

source: Alerts
uz: Ogohlantirishlar

source: Cache
uz: Kesh

source: %(cache_calls)d call in %(time).2fms
uz: %(time).2fmillisekundda %(cache_calls)dta chaqiruvlar

source: Cache calls from %(count)d backend
uz: %(count)dta backend'dan kesh chaqiruvlari

source: Community
uz: Hamjamiyat

source: Headers
uz: Sarlavhalar

source: History
uz: Tarix

source: Profiling
uz: Ishlash tahlili

source: Intercept redirects
uz: Yo‘naltirishni to'xtatish

source: Request
uz: So'rov

source: <no view>
uz: <view yo'q>

source: <unavailable>
uz: <mavjud emas>

source: Settings
uz: Sozlamalar

source: Settings from %s
uz: %sdan sozlamalar

source: %(num_receivers)d receiver of 1 signal
uz: 1 signaldan %(num_receivers)dta qabul qiluvchilar

source: %(num_receivers)d receiver of %(num_signals)d signals
uz: %(num_signals)dta signaldan %(num_receivers)dta qabul qiluvchilar

source: Signals
uz: Signallar

source: Data for this panel isn't available anymore.
uz: Bu panel uchun ma’lumotlar endi mavjud emas.

source: Invalid query id.
uz: So‘rov identifikatori yaroqsiz.

source: Read uncommitted
uz: Tasdiqlanmaganini o'qish

source: Read committed
uz: Tasdiqlanganini o'qish

source: Repeatable read
uz: Takrorlanadigan o'qish

source: Serializable
uz: Serializatsiyalangan

source: Autocommit
uz: Avtomatik saqlash

source: Idle
uz: Bo'sh

source: Active
uz: Aktiv

source: In transaction
uz: Tranzaksiya ichida

source: In error
uz: Xatolik holatida

source: Unknown
uz: Noma'lum

source: %(query_count)d query in %(sql_time).2fms
uz: %(sql_time).2fmillisekundda %(query_count)dta so'rovlar

source: SQL queries from %(count)d connection
uz: %(count)dta ulanishdan SQL so'rovlari

source: Static files (%(num_found)s found, %(num_used)s used)
uz: Statik fayllar (%(num_found)sta topildi, %(num_used)sta ishlatilgan)

source: Static files
uz: Statik fayllar

source: %(num_used)s file used
uz: %(num_used)sta fayl ishlatilgan

source: Templates
uz: Shablonlar

source: Templates (%(num_templates)s rendered)
uz: Shablonlar (%(num_templates)sta ishlatilgan)

source: No origin
uz: Manbasi yo'q

source: CPU: %(cum)0.2fms (%(total)0.2fms)
uz: CPU:%(cum)0.2fmillisekund (%(total)0.2fmillisekund)

source: Total: %0.2fms
uz: Jami: %0.2fmillisekund

source: Time
uz: Vaqt

source: User CPU time
uz: Foydalanuvchi CPU vaqti

source: %(utime)0.3f msec
uz: %(utime)0.3fmillisekund

source: System CPU time
uz: Sistema CPU vaqti

source: %(stime)0.3f msec
uz: %(stime)0.3fmillisekund

source: Total CPU time
uz: Umumiy CPU vaqti

source: %(total)0.3f msec
uz: %(total)0.3fmillisekund

source: Elapsed time
uz: O‘tgan vaqt

source: %(total_time)0.3f msec
uz: %(total_time)0.3fmillisekund

source: Context switches
uz: Kontekst almashishlari

source: %(vcsw)d voluntary, %(ivcsw)d involuntary
uz: %(vcsw)dta ixtiyoriy, %(ivcsw)dta majburiy

source: Versions
uz: Versiyalar

source: Hide toolbar
uz: Uskunalar panelini berkitish

source: Hide
uz: Berkitish

source: Toggle Theme
uz: Mavzuni almashtirish

source: Show toolbar
uz: Uskunalar panelini ko'rsatish

source: Disable for next and successive requests
uz: Keyingi so‘rovlar uchun faolsizlantirish

source: Enable for next and successive requests
uz: Keyingi va keyingi so‘rovlar uchun faollashtirish

source: Alerts found
uz: Ogohlantirishlar topildi

source: No alerts found
uz: Ogohlantirishlar topilmadi

source: Summary
uz: Qisqacha ma'lumot

source: Total calls
uz: Jami chaqiruvlar

source: Total time
uz: Umumiy vaqt

source: Cache hits
uz: Keshga tushgan so'rovlar

source: Cache misses
uz: Keshda topilmaganlar

source: Commands
uz: Buyruqlar

source: Calls
uz: Chaqiruvlar

source: Time (ms)
uz: Vaqt (ms)

source: Type
uz: Tur

source: Arguments
uz: Argumentlar

source: Keyword arguments
uz: Kalit so'zli argumentlar

source: Community & Contribution
uz: Hamjamiyat & Hissa qo'shish

source: Want to contribute to Django Debug Toolbar? Get involved in our community!
uz: Django Tekshiruv Paneliga hissa qo'shmoqchimisiz? Hamjamiyatimizga qo'shiling!

source: Join Discussions
uz: Muhokamalarga Qo'shilish

source: View Issues
uz: Muammolarni Ko'rish

source: Contribution Guide
uz: Hissa Qo'shish Qo'llanmasi

source: Django Debug Toolbar Documentation
uz: Django Tekshiruv Paneli Dokumentatsiyasi

source: Explore the official documentation to learn more about Django Debug Toolbar.
uz: Django Tekshiruv Paneli haqida batafsil ma’lumot olish uchun rasmiy dokumentatsiya bilan tanishib chiqing.

source: Read Documentation
uz: Dokumentatsiyani o'qish

source: How to Use Django Debug Toolbar
uz: Django Tekshiruv Panelidan Foydalanish

source: Request headers
uz: So'rov sarlavhalari

source: Key
uz: Kalit

source: Value
uz: Qiymat

source: Response headers
uz: Javob sarlavhalari

source: WSGI environ
uz: WSGI muhiti

source: Since the WSGI environ inherits the environment of the server, only a significant subset is shown below.
uz: WSGI server muhitini meros qilib olganligi sababli, quyida faqat muhim qism to‘plamlari ko‘rsatilgan.

source: Method
uz: Metod

source: Path
uz: Manzil

source: Request Variables
uz: So'rov O'zgaruvchilari

source: Action
uz: Amal

source: Variable
uz: O'zgaruvchi

source: Call
uz: Chaqiruv

source: CumTime
uz: KumVaqt

source: Per
uz: Har biriga

source: TotTime
uz: JamiVaqt

source: Count
uz: Miqdor

source: View information
uz: Ma'lumotlarni ko'rish

source: View function
uz: Funksiyani ko'rish

source: URL name
uz: URL nomi

source: Cookies
uz: Cookie'lar

source: No cookies
uz: Cookie'lar mavjud emas

source: Session data
uz: Sessiya ma'lumotlari

source: No session data
uz: Sessiya ma'lumotlari mavjud emas

source: GET data
uz: GET ma'lumotlari

source: No GET data
uz: GET ma'lumotlari mavjud emas

source: POST data
uz: POST ma'lumotlari

source: No POST data
uz: POST ma'lumotlari mavjud emas

source: Setting
uz: Sozlama

source: Receivers
uz: Qabul qiluvchilar

source: %(num)s query
uz: %(num)sta so'rov

source: including <abbr title="Similar queries are queries with the same SQL, but potentially different parameters.">%(count)s similar</abbr>
uz: shu jumladan <abbr title="Similar queries are queries with the same SQL, but potentially different parameters.">%(count)sta o'xshash</abbr>

source: and <abbr title="Duplicate queries are identical to each other: they execute exactly the same SQL and parameters.">%(dupes)s duplicates</abbr>
uz: va <abbr title="Duplicate queries are identical to each other: they execute exactly the same SQL and parameters.">%(dupes)sta duplikat</abbr>

source: Query
uz: So'rov

source: Timeline
uz: Xronologiya

source: %(count)s similar queries.
uz: %(count)sta o'xshash so'rovlar.

source: Duplicated %(dupes)s times.
uz: %(dupes)smarta takrorlangan.

source: Connection:
uz: Ulanish:

source: Isolation level:
uz: Izolyatsiya darajasi:

source: Transaction status:
uz: Tranzaksiya statusi:

source: (unknown)
uz: (noma'lum)

source: No SQL queries were recorded during this request.
uz: Bu so‘rov paytida hech qanday SQL so‘rovi qayd qilinmadi.

source: SQL explained
uz: Tushuntirilgan SQL so'rovi

source: Executed SQL
uz: Ijro etilgan SQL so'rovi

source: Database
uz: Ma'lumotlar bazasi

source: SQL profiled
uz: Tahlil qilingan SQL so'rovi

source: Error
uz: Xatolik

source: SQL selected
uz: Tanlangan SQL so'rovi

source: Empty set
uz: Bo'sh to'plam

source: Static file path
uz: Statik fayl manzillari

source: (prefix %(prefix)s)
uz: (old qo'shimcha %(prefix)s)

source: None
uz: Yo'q

source: Static file app
uz: Statik fayl ilovalari

source: Static file
uz: Statik fayllar

source: %(payload_count)s file
uz: %(payload_count)sta fayl

source: Location
uz: Joylashuv

source: Template source:
uz: Shablon manbasi

source: Template path
uz: Shablon manzillari

source: Template
uz: Shablonlar

source: Toggle context
uz: Kontekstni yoqib o'chirish

source: Context processor
uz: Kontekst protsessorlari

source: Resource usage
uz: Resurs sarfi

source: Resource
uz: Resurs

source: Browser timing
uz: Brauzer vaqti

source: Timing attribute
uz: Vaqt ko'rsatkichi

source: Milliseconds since navigation start (+length)
uz: Navigatsiya boshlanganidan beri o'tgan millisoniyalar (+muddat)

source: Package
uz: Paket

source: Name
uz: Nom

source: Version
uz: Versiya

source: Location:
uz: Joylashuv:

source: The Django Debug Toolbar has intercepted a redirect to the above URL for debug viewing purposes. You can click the above link to continue with the redirect as normal.
uz: Django Tekshiruv Paneli paneli nosozliklarni tuzatish maqsadlarida yuqoridagi URL manzilga yo‘naltirishni to'xtatdi. Qayta yo‘naltirishni odatdagidek davom ettirish uchun yuqoridagi havolani bosishingiz mumkin.

source: Data for this panel isn't available anymore. Please reload the page and retry.
uz: Bu panel uchun ma’lumotlar endi mavjud emas. Sahifani qayta yuklang va qayta urinib ko'ring.
